### Operações em DataFrames

In [1]:
import pandas as pd
df = pd.DataFrame({"col1":[1, 2, 3, 4], "col2":[444, 555, 666, 444], "col3":["abc", "def", "ghi", "xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# Podemos usar o método .unique() para saber quais são dados unicos de uma coluna
df["col2"].unique()

array([444, 555, 666])

In [6]:
# Esse método é semelhante ao unique() do numpy
import numpy as np
np.unique(df["col2"])

array([444, 555, 666])

In [7]:
# Para saber a quantidade de dados não repetidos podemos fazer isso de duas formas
len(df["col2"].unique())
df["col2"].nunique()

3

In [9]:
# O método value_counts() fornece o número de vezes que o elemento ocorre na coluna do DataFrame
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [15]:
# Podemos passar condições em um dataframes para visualizar seus dados
df[(df["col1"]>2) & (df["col2"]==444)]

   col1  col2 col3
3     4   444  xyz

In [21]:
def vezes2(x):
    return x*2

In [28]:
# Podemos aplicar a função anterior criada nos elementos do dataframes usando o método apply()
# Obs: o apply() aplica uma função que nesse caso ira ter apenas um retorno de valor
df["col1"].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [30]:
df["col2"].apply(lambda x: x*x)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [17]:
# Podemos usar diferentes métodos para os dataframes e nesse caso somar os elementos
df.sum()

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [18]:
# Podemos somar os elementos de uma coluna especifica
df["col2"].sum()

2109

In [31]:
# Podemos usar o método columns para saber quais os valores dos index da coluna
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [32]:
# Podemos usar o método index para saber quais os valores dos index da linha
df.columns

RangeIndex(start=0, stop=4, step=1)

In [33]:
# Podemos ordenar os valores do dataframe
# Essa função também possui o atributo inplace e por padrão é False
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [34]:
# O método .isnull() vai perguntar ao dataframe qual método é núlo
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [36]:
# Criando outro dataframe com valores nulos=nan
df = pd.DataFrame({"col1":[1, 2, 3, np.nan], "col2":[np.nan, 555, 666, 444], "col3":["abc", "def", "ghi", "xyz"]}); df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [41]:
# Podemos usar o método fillna() para fazer o tratamento de valores faltantes
df["col1"].fillna(value=df["col1"].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [43]:
data = {"A":["foo", "foo", "foo", "bar", "bar", "bar"],
       "B":["One", "One","Two", "Two", "One", "One"],
       "C":["x", "y", "x", "y", "x", "y"],
       "D":[1, 3, 2, 5, 4, 1]}
df = pd.DataFrame(data); df

     A    B  C  D
0  foo  One  x  1
1  foo  One  y  3
2  foo  Two  x  2
3  bar  Two  y  5
4  bar  One  x  4
5  bar  One  y  1

In [44]:
# Usando o método pivot_table() para ordenar os dados de acordo com uma coluna especifica
# Obs que foi criado um novo dataframe com indices multiniveis
df.pivot_table(values="D", index=["A", "B"], columns=["C"])

C          x    y
A   B
bar One  4.0  1.0
    Two  NaN  5.0
foo One  1.0  3.0
    Two  2.0  NaN